---
type: AddInId
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# AddInId

`Autodesk.Revit.DB.AddInId` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | AddInId | 2011 | `public AddInId ( Guid val )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetAddInName | 2011 | `public string GetAddInName ()` |
| Method | GetAddInNameFromDocument | 2011 | `public string GetAddInNameFromDocument ( Document aDoc )` |
| Method | GetGUID | 2011 | `public Guid GetGUID ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |